{
  "posts": [
    {
      "id": "1",
      "title": "Thoughts on living in Thailand",
      "date": "December 15, 2023",
      "preview": "Live, work and play",
      "minutes": 5,
      "content": "I had rarely travelled before I decided to hop on a plane and live in Thailand for the rest of my life.I ended up working and living in Thailand for only one year. Most of my friends said it would last only a few months, so I'm glad I could at least stick it out that long.I've come to realise many people have decided, like me, to relocate to Thailand from the West.There are many good and bad things about living in another country. I have been back in Australia for a while now and I suppose it is a good time to reflect on the experience. Of course, I did read Atomic Habits as well. One of the strategies I use is the Daily Habit Tracker, where the aim is to keep a daily record of what you do each day. For example, if your desired habit is to write a blog post every day, you should make a tick in the daily habit tracker if you manage to write that day. If you didn’t achieve that task on a given day, you should make sure that you don’t miss two days in a row. The idea is that it helps you to form a new habit. "
    },
    {
      "id": "2",
      "title": "Self-development Books You Should Read",
      "date": "December 11, 2020",
      "preview": "Reading your way to the top",
      "minutes": 15,
      "content": "The first book was called, How to Fail at Everything and Win Big. Anyway, it was a really great book. It was the best book I have read about success and I often think back about it. For example, he claims he used affirmations to help him achieve specific things. I have also used affirmations in life and this has gotten me out of difficult situations I used a kind of. I enjoyed reading it as the story was told in a laid-back, humorous style where he made fun of his failure and the difficulties he had encountered. He also suggested what success meant and what your life would look like if it were more successful such as having more autonomy in your daily schedule. He also first introduced to me the idea that it's better to have a system than a goal if you want to succeed. If you have a goal, then you are always feeling unhappy when you are not arriving at that goal. If you have a system such as training each day, then you can celebrate when you are executing your system. Kind of like the recodiation in Atomic Habits where your daily habits become a kind of system to propel you into a better life."
    },
    {
      "id": "3",
      "title": "Escaping Australia",
      "preview": "Sometimes you have to go",
      "minutes": 47,
      "content": "I had bought a house and I felt happier that year. Not happy but happier. I still felt stuck, I felt the limitations of life cramping in upon me. But that was not atypical for me. Even though I felt stuck that house brought me happiness. I loved living there and it gave me a sense of peace to return home each day. Despite working in a job I hated, there was something about that house that made me feel alive. It was a small weatherboard, but I suppose because I experienced so much in the year, I was there in that small house these memories will always stay with me and will be so treasured.What made that house special was that it represented the desire to succeed. It was in my small weatherboard house in Nyah that I raised pets for the first time. I had a mischievous cat, several chickens and a dog, which belonged to my housemate. I took on 3 jobs, including my main work and some tutoring done on the internet. I also invested in stocks and crypto and I set up an online business, selling items on Amazon and eBay. My finances were getting in order and I had two properties in my name with easily affordable mortgage payments. "
    },
    {
      "id": "d3fc",
      "title": "Benefits of a Morning Routine ",
      "preview": "Why I used a morning routine.  ",
      "article": "There are people out there who say a morning routine transformed their lives and made them happier, wealthy and more successful.   When I first started to do the routine, I had my full-time job and several side hustles I was trying out, none of which made much money and some of which took far too much of my time. So, I was earning a decent amount of money, especially as my expenses were low. But financially I didn’t become rich and didn’t make the kinds of income you would expect from a moderately successful entrepreneur.   Then, after the extreme covid lockdowns in Victoria, I was determined to leave the country, and I worked in Thailand for one year. Still, because I worked in the evening, I normally slept late after drinking a lot of beer, so the morning routine became a late morning routine. "
    },
    {
      "id": "41f5",
      "title": "The Thailand Experience",
      "preview": "A life-changing event",
      "article": "Anyway, once the government in my country started to introduce mask mandates and make working for a living illegal unless you were willing to take the death shot, I badly wanted to move to a country with more freedom. It did not take much reading of the news to work out that there were very few countries outside of Sweden and Taiwan that still had any semblance of freedom."
    },
    {
      "id": "3c63",
      "title": "A great",
      "preview": "Post",
      "article": "Here it is"
    }
  ]
}